#!/bin/bash

# 取自 http://davidaq.com/technique/share/2015/08/10/shell-console-color-table.html

echo ""
echo "----------------------------------------------------------------------------------------"
echo -e "\033[30;47m                               [console 上可以输出的颜色表]                             \033[0m"
echo "----------------------------------------------------------------------------------------"
T='Text'
echo -e "         --       40       41       42       43       44       45       46       47 "
for FGs in '   0' '   1' '  30' '1;30' '  31' '1;31' '  32' '1;32' '  33' '1;33' '  34' '1;34' '  35' '1;35' '  36' '1;36' '  37' '1;37'
    do FG=${FGs// /}m 
    echo -en " $FGs \033[$FG  $T  "
    for BG in 40m 41m 42m 43m 44m 45m 46m 47m 
        do echo -en "$EINS \033[$FG\033[$BG  $T \033[0m\033[$BG \033[0m"
    done
    echo
done
echo -e "\033[0m"


echo ""
echo "----------------------------------------------------------------------------------------"
echo -e "\033[30;47m                               [lager 中默认配色方案]                             \033[0m"
echo "----------------------------------------------------------------------------------------"
echo -e  "\033[0;38m lager 中 debug 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;37m lager 中 info 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;36m lager 中 notice 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;33m lager 中 warning 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;31m lager 中 error 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;35m lager 中 critical 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;44m lager 中 alert 日志级别使用的配色方案 \033[0m"
echo -e  "\033[1;41m lager 中 emergency 日志级别使用的配色方案 \033[0m"

